// //- Є змінна х, якій ви надаєте довільне числове значення.
// //    Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let x = +prompt('Введіть число 1, 0, -3')
// if (x !== 0) {
//     console.log(true)
// } else {
//     console.log(false)
// }

//- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//(в першу, другу, третю или четверту частину години).
//  let time = +prompt('До якої четверті години попадає число  0-59')
// if (time >= 0 && time <= 14) {
//     console.log('в першу')
// } else if (time >= 15 && time <= 29) {
//     console.log('другу')
// } else if (time >= 30 && time <=44) {
//     console.log('третю ')
//
// } else if (time >= 45 && time <= 59) {
//     console.log('четверту')
// } else {
//     console.log('Некоректні дані')
// }

//- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = +prompt('у яку половину місяця потрапляє це число')
// if (day >= 1 && day <= 10) {
//     console.log('Перша')
// } else if (day >= 11 && day <= 20) {
//     console.log('Друга')
// } else if (day>=21 && day<=31){
//     console.log('Третя')
// }
// else {
//     console.log('Некоректні дані ')
// }

//Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
// let week = +prompt('Введіть порядковій номер дня тижня від 1-7')
// switch (week) {
//     case 1:
//         alert('Monday')
//         break
//     case 2:
//       alert('Tuesday')
//         break
//     case 3:
//         alert('Wednesday')
//         break
//     case 4:
//         alert('Thursday')
//         break
//     case 5:
//         alert('Friday')
//         break
//     case 6:
//         alert('Saturday')
//         break
//     case 7:
//         alert('Sunday')
//         break
//
//     default:alert( 'false')
// }

//- Користувач вводить або має два числа.Потрібно знайти та вивести максимальне число з тих двох .Також потрібно врахувати коли введені рівні числа.
// let user=+prompt('знайдіть максимальне число ')
// if (user>= 0 && user <=13){
//     alert('замало')
// }
// else if (user===14){
//     alert(' перше мінімальне  число')
// }
// else if (user>=15 && user<=19){
//     alert('дуже близько')
// }
// else if (user===20){
//     alert('так це максимальне  20')
// }
// else {
//     alert('Забагато')
// }
//- є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
   // за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
можна якись приклад бо нерозумію як це зробити ?
